; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-0 - location
	p1-3 - location
	p2-3 - location
	p2-4 - location
	p4-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s1)
	(at driver4 s3)
	(at driver5 s1)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s0)
	(at package2 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(link s1 s0)
	(link s0 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s4)
	(at driver4 s2)
	(at driver5 s3)
	(at truck1 s2)
	(at truck3 s0)
	(at truck4 s4)
	(at package1 s0)
	(at package2 s4)
	))


)

; plan
1. (walk driver1 s4 p4-1)
   deleted: (at driver1 s4)
   added: (at driver1 p4-1)
   goals met: 3 of 10
2. (walk driver1 p4-1 s1)
   deleted: (at driver1 p4-1)
   added: (at driver1 s1)
   goals met: 4 of 10
3. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 4 of 10
4. (drive-truck truck1 s3 s1 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 4 of 10
5. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   goals met: 4 of 10
6. (drive-truck truck1 s1 s4 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 4 of 10
7. (unload-truck package2 truck1 s4)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 5 of 10
8. (drive-truck truck1 s4 s2 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 6 of 10
9. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 7 of 10
10. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 10
11. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 7 of 10
12. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 7 of 10
13. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 8 of 10
14. (walk driver3 s1 p4-1)
   deleted: (at driver3 s1)
   added: (at driver3 p4-1)
   goals met: 8 of 10
15. (walk driver3 p4-1 s4)
   deleted: (at driver3 p4-1)
   added: (at driver3 s4)
   goals met: 9 of 10
16. (walk driver5 s1 p1-3)
   deleted: (at driver5 s1)
   added: (at driver5 p1-3)
   goals met: 9 of 10
17. (walk driver5 p1-3 s3)
   deleted: (at driver5 p1-3)
   added: (at driver5 s3)
   goals met: 10 of 10
